# 날짜 : 2024.01.18
# 이름 : 김준형
# 내용 : 7장 정규화 실습하기

#비정규형 테이블
create table `bookorder` (
`orderNo` int,
`orderDate` date,
`userId` varchar(10),
`userNmae` varchar(10),
`userAddr` varchar(50),
`bookNo` int,
`userName` varchar(20),
`count` int,
`price` int  );

insert into `Bookorder` values
('10001', now(), 'a101', '김유신', '김해', '101', '프로그래밍', '1', '28000'),
('10002', now(), 'a102', '김춘추', '경주', '101', '프로그래밍', '1', '25000'),
('10002', now(), 'a102', '김춘추', '경주', '102', '자료구조', '2', '16000'),
('10003', now(), 'a103', '장보고', '완도', '102', '자료구조', '2', '32000'),
('10004', now(), 'a104', '강감찬', '서울', '110', '데이터베이스', '1', '25000'),
('10005', now(), 'a105', '이순신', '서울', '110', '프로그래밍', '1', '25000'),
('10005', now(), 'a105', '이순신', '서울', '102', '프로그래밍', '1', '16000');

insert into `Book` values
('101', '프로그래밍'),
('102', '자료구조'),
('110', '데이터베이스');

insert into `user` values
('a101', '김유신', '김해'),
('a102', '김춘추', '경주'),
('a103', '장보고', '완도'),
('a104', '감강찬', '서울'),
('a105', '이순신', '서울');

insert into `userOrder` values
('10001', now(), 'a101'),
('10002', now(), 'a102'),
('10003', now(), 'a103'),
('10004', now(), 'a104'),
('10005', now(), 'a105');


insert into `Order` values
('10001', '101', '1', '28000'),
('10002', '101', '1', '25000'),
('10002', '102', '2', '16000'),
('10003', '102', '2', '32000'),
('10004', '110', '1', '25000'),
('10005', '102', '1', '16000');